{
  "posts": [
    {
      "id": 1,
      "title": "Artificial Intelligence",
      "body": "Artificial Intelligence is redefining industries from healthcare to finance. With machine learning models becoming more efficient, the future of work and creativity will be strongly influenced by AI-driven tools.",
      "userId": 1
    },
    {
      "id": 2,
      "title": "Global Economy",
      "body": "The global economy is witnessing rapid shifts with digital transformation and geopolitical changes. Understanding new market dynamics is essential for sustainable growth and resilience.",
      "userId": 2
    },
    {
      "id": 3,
      "title": "Climate Change",
      "body": "Climate change impacts every corner of the planet. Innovative green technologies and global cooperation are needed to address rising temperatures and extreme weather patterns.",
      "userId": 3
    },
    {
      "id": 4,
      "title": "Blockchain",
      "body": "Blockchain technology goes far beyond cryptocurrency. Its power in supply chain transparency, decentralized finance, and digital identity is only starting to be realized.",
      "userId": 1
    },
    {
      "id": 5,
      "title": "Remote Work",
      "body": "Remote work is no longer a perk, it’s a norm. Companies embracing hybrid and remote-first cultures are attracting talent across borders and unlocking productivity benefits.",
      "userId": 2
    },
    {
      "id": 6,
      "title": "Space Exploration",
      "body": "Private companies and government agencies are reigniting interest in space exploration. Missions to Mars and lunar bases are setting the stage for a multi-planetary future.",
      "userId": 3
    },
    {
      "id": 7,
      "title": "Cybersecurity",
      "body": "As digital footprints expand, so do cyber threats. Businesses and individuals need stronger practices and tools to ensure data privacy and protection against attacks.",
      "userId": 1
    },
    {
      "id": 8,
      "title": "Healthcare Innovation",
      "body": "Advances in telemedicine, wearable health devices, and AI diagnostics are transforming patient care. Accessibility and affordability remain central to true healthcare innovation.",
      "userId": 2
    },
    {
      "id": 9,
      "title": "Renewable Energy",
      "body": "Solar, wind, and hydro power are reshaping the global energy landscape. Investment in renewables is key to reducing carbon emissions and achieving sustainability goals.",
      "userId": 3
    },
    {
      "id": 10,
      "title": "Metaverse",
      "body": "The metaverse is blending virtual and physical realities. From social interactions to commerce, this digital universe could transform how people work, play, and connect.",
      "userId": 1
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "AI is the most disruptive force since the internet—couldn’t agree more.",
      "postId": 1,
      "userId": 2
    },
    {
      "id": 2,
      "body": "Remote work truly broadened opportunities for global talent.",
      "postId": 5,
      "userId": 3
    },
    {
      "id": 3,
      "body": "Blockchain beyond crypto is where the magic lies.",
      "postId": 4,
      "userId": 3
    },
    {
      "id": 4,
      "body": "Space exploration inspires us to dream bigger every time.",
      "postId": 6,
      "userId": 1
    },
    {
      "id": 5,
      "body": "Cybersecurity awareness should be taught as a basic life skill.",
      "postId": 7,
      "userId": 2
    },
    {
      "id": 6,
      "body": "Renewables are no longer optional, they’re inevitable.",
      "postId": 9,
      "userId": 1
    },
    {
      "id": 7,
      "body": "Also seeing AI augment, not replace, many roles right now.",
      "postId": 1,
      "userId": 3
    },
    {
      "id": 8,
      "body": "Curious how we’ll regulate foundation models responsibly.",
      "postId": 1,
      "userId": 1
    },
    {
      "id": 9,
      "body": "Mitigation must go hand-in-hand with adaptation strategies.",
      "postId": 3,
      "userId": 2
    },
    {
      "id": 10,
      "body": "Carbon pricing and green finance can accelerate change.",
      "postId": 3,
      "userId": 1
    },
    {
      "id": 11,
      "body": "Real utility shows up in transparent supply chains.",
      "postId": 4,
      "userId": 2
    },
    {
      "id": 12,
      "body": "Telemedicine only works if broadband access is equitable.",
      "postId": 8,
      "userId": 1
    },
    {
      "id": 13,
      "body": "Wearables are great—but data privacy must be paramount.",
      "postId": 8,
      "userId": 3
    },
    {
      "id": 14,
      "body": "Grid storage is the missing puzzle piece for wind/solar.",
      "postId": 9,
      "userId": 2
    },
    {
      "id": 15,
      "body": "Community-scale projects can drive faster adoption.",
      "postId": 9,
      "userId": 3
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "mhassanjamil",
      "name": "M Hassan Jamil"
    },
    {
      "id": 2,
      "username": "johndoe",
      "name": "John Doe"
    },
    {
      "id": 3,
      "username": "tonystark",
      "name": "Tony Stark"
    }
  ]
}